NameList = ["王 咪","汪佳慧","师瑞云","王庆晨","胡 杨","胡浩南","夏宇龙","田明俊","谢应楠","张嘉怡","卓妮娜","张潇娟","王 朔","何泰文","徐佳豪","崔 灿","张一杭","蒋经瑀","赵凡星","王瑾瑞","王 荣","张哲源","李万邦","聂宇翔","左 程","周嘉怡","刘新宇","韩甜甜","张泽元","李海媚","孔炫臻","杨 荣","周梦凡","丁恺頔","薛淇元","曹文博","洪 涛","胡瑞平"];
% 在此处修改名单。
% 要求：
% ①每个名字用英文引号引起来；
% ②名字之间用英文逗号隔开；
% ③第一个名字之前和最后一个名字之后分别用一对英文方括号括起来；
% ④名单必须一行输入完毕，否则会出错。
amountOfPeople = 38;
% 在此处修改人数，数字须与名单人数一致

% 【以下代码勿动，否则程序会出错】
% ↓↓↓
% 生成一个 0~人数 之间的随机数
num = floor(rand()*(amountOfPeople+1));
% “+1”的原因：经调试，可能会抽不到名单当中的最后一个人，为确保公平故有此举。
% 如果生成的数字为0，则再次生成。直到数字不为0为止
% （MATLAB中索引从1开始，而不从0开始，所以如果随机生成的索引值为0的话会出错）
while num == 0
    num = floor(rand()*(amountOfPeople+1));
    % “+1”的原因：经调试，可能会抽不到名单当中的最后一个人，为确保公平故有此举。
end
% 在输出名字之前清空屏幕，保持屏幕的清爽
clc
NameList(num)
% ↑↑↑
% 【以上的代码勿动，否则程序会出错】